/*Напишите программу, которая на вход 
принимает число и выдаёт его квадрат (число 
умноженное на само себя).
*/
Console.WriteLine("Enter any integer number:");
int N = int.Parse(Console.ReadLine()); 
Console.Write("Square of your number is:");
Console.WriteLine(N*N);


